my-config.el
(use-package try
  :ensure t)

(setq inhibit-splash-screen t)       ;; disable the splash screen
(setq initial-scratch-message nil)   ;; disable scratch message
(tool-bar-mode -1)                   ;; all bars off
(menu-bar-mode -1)
(scroll-bar-mode -1)
(blink-cursor-mode -1)
(column-number-mode 1)               ;; show cursor position
(global-visual-line-mode t)          ;; visual line mode everywhere
(global-hl-line-mode t)              ;; highlight active line
;; (set-face-background ('hl-line) "#202020")
(fset 'yes-or-no-p 'y-or-n-p)        ;; ask me for y or n
(setq select-enable-clipboard t)     ;; use the clipboard for yanking
(setq save-interprogram-paste-before-kill t)
(setq help-window-select t)          ;; always focus on help windows
(setq sentence-end-double-space nil) ;; better sentence navigation
(delete-selection-mode 1)            ;; typing deletes selected text
(set-language-environment "UTF-8")   ;; always use UTF-8 encoding
(set-default-coding-systems 'utf-8)

(put 'downcase-region 'disabled nil) ;; binds to 'C-x C-l'
(put 'upcase-region 'disabled nil) ;; binds to 'C-x C-u'
(put 'narrow-to-region 'disabled nil) ;; binds to 'C-x n n'

(global-set-key (kbd "C-<next>") 'text-scale-increase)
(global-set-key (kbd "C-<prior>") 'text-scale-decrease)

(display-line-numbers-mode t)

(use-package linum-relative
  :ensure t
  :init
  (setq linum-relative-current-symbol "")
  :bind ("C-x M-l" . linum-relative-toggle))

(use-package darkroom
  :ensure t
  :init
  (setq darkroom-text-scale-increase 0.8)
  :bind
  (("C-M-_" . darkroom-decrease-margins)
   ("C-x M-D" . darkroom-tentative-mode)))

(global-set-key (kbd "C-x M-L") 'follow-mode)

(use-package rainbow-mode
  :ensure t
  :hook prog-mode)

(use-package color-theme-sanityinc-tomorrow
  :ensure t)

(color-theme-sanityinc-tomorrow--define-theme bright)

(use-package which-key
  :ensure t
  :config (which-key-mode))

;; use separate custom file
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

;; backup files
(setq backup-directory-alist `(("." . "~/.emacs.d/backups")))
(setq backup-by-copying t) ;; this is to ensure all edited files keep their inodes

(global-set-key (kbd "C-x C-S-e") 'eval-buffer)

(global-set-key (kbd "C-;") 'comment-line)
(global-set-key (kbd "C-M-;") 'comment-or-uncomment-region)

(use-package smartparens-config
  :ensure smartparens
  :init
  (smartparens-global-mode 1)
  (show-smartparens-global-mode 1)
  :bind
  ("M-s" . sp-splice-sexp))

(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package expand-region
  :ensure t
  :bind
  (("C-=" . er/expand-region)
   ("C-c =" . er/expand-region)
   ("C--" . er/contract-region)
   ("C-c -" . er/contract-region)))

(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

(global-set-key [remap move-beginning-of-line] 'smarter-move-beginning-of-line)

(global-set-key (kbd "C-S-k") 'kill-whole-line)

(defun duplicate-line()
  "Duplicates a line."
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank))

(global-set-key (kbd "C-c d") 'duplicate-line)

(windmove-default-keybindings) ;; use arrow keys ot navigate

;; resize shortcuts
(global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>") 'shrink-window)
(global-set-key (kbd "S-C-<up>") 'enlarge-window)

(use-package ace-window
  :ensure t
  :bind
  (("C-x o" . ace-window)
   ("C-x M-o" . ace-swap-window)))

(defun split-and-follow-horizontally ()
  "Split and follow container horizontally."
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))

(defun split-and-follow-vertically ()
  "Split and follow container vertically."
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

(defun toggle-window-split ()
  "Switch between horizontal and vertical split when using two windows."
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
	     (next-win-buffer (window-buffer (next-window)))
	     (this-win-edges (window-edges (selected-window)))
	     (next-win-edges (window-edges (next-window)))
	     (this-win-2nd (not (and (<= (car this-win-edges)
					 (car next-win-edges))
				     (<= (cadr this-win-edges)
					 (cadr next-win-edges)))))
	     (splitter
	      (if (= (car this-win-edges)
		     (car (window-edges (next-window))))
		  'split-window-horizontally
		'split-window-vertically)))
	(delete-other-windows)
	(let ((first-win (selected-window)))
	  (funcall splitter)
	  (if this-win-2nd (other-window 1))
	  (set-window-buffer (selected-window) this-win-buffer)
	  (set-window-buffer (next-window) next-win-buffer)
	  (select-window first-win)
	  (if this-win-2nd (other-window 1))))))

(global-set-key (kbd "C-x |") 'toggle-window-split)

(global-set-key (kbd "C-x \\") 'window-swap-states)

(use-package helm-config
  :ensure helm
  :defer 1
  :init
  (setq helm-follow-mode-persistent t)
  (setq  helm-split-window-inside-p t)
  :config
  (helm-mode 1)
  :bind
  (("M-x" . helm-M-x)
   ("C-x C-f" . helm-find-files)
   ([remap switch-to-buffer] . helm-buffers-list)))

(use-package swoop
  :ensure t
  :init
  (setq swoop-font-size-change: nil)
  :bind
  (("C-S" . swoop)
   ("C-R" . swoop-back-to-last-position)
   :map swoop-map
   ("C-o" . swoop-multi-from-swoop)
   :map isearch-mode-map
   ("C-o" . swoop-from-isearch)))
