my-config.org
** AUTOCOMPLETE

   #+begin_src emacs-lisp
   (use-package auto-complete
     :ensure t
     :init
     (progn
       (ac-config-default)
       (global-auto-complete-mode t)
       (setq ac-sources (append ac-sources '(ac-sources-filename)))
       (setq ac-ignore-case nil)))
   #+end_src

** MULTIPLE CURSORS

   #+begin_src emacs-lisp
   (use-package multiple-cursors
     :ensure t
     :bind
     ("C-s-c C-s-c" . mc/edit-lines)
     ("C->" . mc/mark-next-like-this)
     ("C-<" . mc/mark-previous-like-this)
     ("C-c C-<" . mc/mark-all-like-this)
     ("C-<down-mouse-1>" . mc/add-cursor-on-click)
     ("C-!" . mc/insert-numbers))

   (use-package mc-extras
     :ensure t
     :after multiple-cursors)

   (use-package ace-mc
     :ensure t
     :after multiple-cursors
     :bind
     ("C-c )" . ace-mc-add-multiple-cursors)
     ("C-M-)" . ace-mc-add-single-cursor))
   #+end_src

** DIRED
*** Image dired
   
    #+begin_src emacs-lisp
    (setq image-dired-thumb-width 250)
    (setq image-dired-thumbs-per-row 4)
    (setq image-dired-external-viewer "sxiv")
    #+end_src

*** Peep dired

    #+begin_src emacs-lisp
    (use-package peep-dired
      :ensure t
      :after dired
      :bind
      (:map dired-mode-map
	    ("P" . peep-dired)))
    #+end_src

*** Ranger dired

    #+begin_src emacs-lisp
    (use-package ranger
      :ensure t
      :after dired
      :init
      (setq ranger-show-literal nil)
      (setq ranger-show-hidden nil)
      (setq ranger-dont-show-binary t)
      (setq ranger-cleanup-on-disable t)
      :bind
      (:map dired-mode-map
	    ("r" . dired-do-rename)
	    ("R" . ranger-mode)))
    #+end_src

*** attatch marked files to email
Using dired, as found [[https://emacs.stackexchange.com/questions/14652/attach-multiple-files-from-the-same-directory-to-an-email-message][here]].

Open a dired buffer, mark some files and run the command. If there's an open message buffer use it, else create new message

#+begin_src emacs-lisp
(defun compose-attach-marked-files ()
  "Compose mail and attach all the marked files from a dired buffer."
  (interactive)
  (let ((files (dired-get-marked-files)))
    (compose-mail nil nil nil t)
    (dolist (file files)
          (if (file-regular-p file)
              (mml-attach-file file
                               (mm-default-file-encoding file)
                               nil "attachment")
            (message "skipping non-regular file %s" file)))))

(define-key dired-mode-map (kbd "C-c M-.") 'compose-attach-marked-files)
#+end_src

** ORG-MODE
*** Ensure org-plus-contrib

    #+begin_src emacs-lisp
    (unless (package-installed-p 'org-plus-contrib)
      (package-refresh-contents)
      (package-install 'org-plus-contrib))
    #+end_src

*** Org-mode misc options

    #+begin_src emacs-lisp
    ;; prettify
    (setq org-hide-leading-stars t)

    ;; src options
    (require 'org-tempo)

    (setq org-src-fontify-natively t)
    (setq org-src-tab-acts-natively t)
    (setq org-confirm-babel-evaluate nil)
    (setq org-edit-src-content-indentation 0)

    ;; export options -- for mail html export (fix it locally!)
    (setq org-export-with-toc nil)
    (setq org-export-with-section-numbers nil)

    ;; links
    (setq org-link-search-must-match-exact-headline nil)
    #+end_src

*** Org-mode capture and agenda

    #+begin_src emacs-lisp
    ;; files
    (setq org-directory "~/.personal")
    (setq org-default-notes-file (concat org-directory "/organizer.org"))

    ;; TODOs
    (setq org-log-done 'time)
    (setq org-log-into-drawer 'LOGBOOK)
    (setq org-clock-into-drawer t)


    ;; bindings
    (global-set-key (kbd "C-c l") 'org-store-link)
    (global-set-key (kbd "C-c a") 'org-agenda)
    (global-set-key (kbd "C-c c") 'org-capture)
    (global-set-key (kbd "C-c C-x C-z") 'org-resolve-clocks)

    ;; some capture functions from Zamansky's configuration
    (defadvice org-capture-finalize 
	(after delete-capture-frame activate)  
      "Advise capture-finalize to close the frame"  
      (if (equal "capture" (frame-parameter nil 'name))  
	  (delete-frame)))

    (defadvice org-capture-destroy 
	(after delete-capture-frame activate)  
      "Advise capture-destroy to close the frame"  
      (if (equal "capture" (frame-parameter nil 'name))  
	  (delete-frame)))  

    (defun make-capture-frame ()
      "Create a new frame and run org-capture."
      (interactive)
      (make-frame '((name . "capture")))
      (select-frame-by-name "capture")
      (delete-other-windows))
    #+end_src

*** Org-capture templates

    #+begin_src emacs-lisp
    (setq org-capture-templates
	  '(("t" "Todo" entry (file+headline "" "Tasks")
	     "* TODO %?\n  %i\n  %a")

	    ("j" "Journal" entry (file+datetree "journal.org")
	     "* %^{entry title}%^G\n%U\n  %?\n")

	    ("p" "Logs for photographic process")

	    ("pd" "Darkroom log" entry (file+datetree "darkroom-log.org")
	     "* %U :darkroom:%^g\n%?" :clock-in t)

	    ;; ("B" "Web purchase" entry (file+headline "web-stuff.org" "Purchases")
	    ;;  "* ORDERED %^{item desc.}\n\n%x\n\nEst. delivery: %?\n\nOrder placed on: %U")

	    ;; ("l" "Link" entry (file+headline "web-stuff.org" "Links")
	    ;;  "* %x %^g\n %?\n%U")

	    ;; ("b" "Bibliography reference" entry (file "bib-references.org")
	    ;;  "* @%^{.bib entry}: %^{description} %^g\n %^{page(s)} %?\n%U")

	    ;; ("c" "Contact" entry (file "contacts.org")
	    ;;  "* %^{nickname}\n:PROPERTIES:\n:NAME: %^{name}\n:EMAIL: [[%^{email}]]\n:END:")
	    ))
    #+end_src
    
*** Org-contacts
    #+begin_src emacs-lisp
    (use-package org-contacts
      :ensure nil
      :after org
      :custom (org-contacts-files '("~/.personal/contacts.org")))
    #+end_src
** LATEX

   #+begin_src emacs-lisp
   (setq TeX-parse-self t)
   (setq-default TeX-master nil)

   ;; === run xelatex on save for latex mode
   (defun latex-save-compile ()
     "Compile file after saving in latex mode. Using Xelatex."
     (when (eq major-mode 'latex-mode)
       (when (memq this-command '(save-buffer))
	 (shell-command-to-string (format "xelatex %s" buffer-file-name)))))

   (add-hook 'after-save-hook #'latex-save-compile)
   #+end_src
   
** MU4E
*** mu4e basic setup

    #+begin_src emacs-lisp
    (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")
    (require 'mu4e)

    (global-set-key (kbd "C-x m") 'mu4e)

    ;; some interface options
    (setq mu4e-confirm-quit nil) ;; do not confirm quitting
    (setq mail-user-agent 'mu4e-user-agent) ;; make mu4e the default for email
    (setq message-kill-buffer-on-exit t) ;; kill message buffer on exit
    (setq mu4e-index-update-in-background t) ;; do not show me the update process
    (setq mu4e-hide-index-messages t)
    (setq mu4e-headers-include-related nil)
    (setq mu4e-compose-dont-reply-to-self nil)
    (setq mu4e-compose-signature-auto-include nil)
    (setq mu4e-sent-messages-behavior 'sent)
    (setq mu4e-change-filenames-when-moving t)
    (setq mu4e-attachment-dir "~/Downloads")
    (setq mu4e-view-show-addresses t)
    ;; this one does not work out of the box. Emacs needs to be compiled with imagemagick support. Will look into this
    (setq mu4e-show-images t)
    (when (fboundp 'imagemagick-register-types)
      (imagemagick-register-types))

    (add-to-list 'mu4e-view-actions '("ViewInBrowser" . mu4e-action-view-in-browser) t)

    (setq mu4e-user-mail-address-list '("loukas.bass@gmx.com"
					"dakodeon@hotmail.com"
					"freehuggs701@gmail.com"))
    #+end_src

*** mu4e (smtp setup)

    #+begin_src emacs-lisp
    (require 'smtpmail)

					    ; smtp defaults
    (setq message-send-mail-function 'smtpmail-send-it
	  ;; smtpmail-starttls-credentials
	  ;; '(("mail.gmx.com" 587 nil nil))
	  smtpmail-default-smtp-server "mail.gmx.com"
	  smtpmail-smtp-server "mail.gmx.com"
	  smtpmail-smtp-user "loukas.bass@gmx.com"
	  smtpmail-stream-type 'starttls
	  smtpmail-smtp-service 587
	  smtpmail-debug-info t)
    #+end_src

*** mu4e sync mail

    #+begin_src emacs-lisp
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-html2text-command "w3m -T text/html")
    (setq mu4e-update-interval nil) ;; do not auto-update, this is done with cronjob
    (setq mu4e-headers-auto-update t)
    #+end_src

*** mu4e directories

    #+begin_src emacs-lisp
    (setq mu4e-maildir (expand-file-name "~/.personal/Mail"))

    ;; default directories
    (setq mu4e-drafts-folder "/loukas.bass/Drafts")
    (setq mu4e-sent-folder "/loukas.bass/Sent")
    (setq mu4e-trash-folder "/loukas.bass/Trash")

    ;; maildirs shortcuts
    (setq mu4e-maildir-shortcuts
	  '( ("/Inbox" . ?i)
	     ("/loukas.bass/Inbox" . ?l)
	     ("/loukas.bass/Sent" . ?s)
	     ("/loukas.bass/Trash" . ?t)
	     ("/loukas.bass/Drafts" . ?D)
	     ("/gmail/Inbox" . ?g)
	     ("/dakodeon/Inbox" . ?d)))
    #+end_src

