my-config.el

(setq mu4e-contexts
      `( ,(make-mu4e-context
	   :name "loukas.bass"
	   :match-func (lambda (msg)
			 (when msg
			   (mu4e-message-contact-field-matches msg
							       :to "loukas.bass@gmx.com")))
	   :vars '((smtpmail-smtp-user . "loukas.bass@gmx.com")
		   (smtpmail-default-smtp-server . "mail.gmx.com")
		   (smtpmail-smtp-server . "mail.gmx.com")
		   (user-mail-address . "loukas.bass@gmx.com")
		   (user-full-name . "loukas bass")
		   (mu4e-sent-folder . "/loukas.bass/Sent")
		   (mu4e-drafts-folder . "/loukas.bass/Drafts")
		   (mu4e-trash-folder . "/loukas.bass/Trash")))

	 ,(make-mu4e-context
	   :name "gmail"
	   :match-func (lambda (msg)
			 (when msg
			   (mu4e-message-contact-field-matches msg
							       :to "freehuggs701@gmail.com")))
	   :vars '((smtpmail-smtp-user . "freehuggs701@gmail.com")
		   (smtpmail-default-smtp-server . "smtp.gmail.com")
		   (smtpmail-smtp-server . "smtp.gmail.com")
		   (user-mail-address . "freehuggs701@gmail.com")
		   (user-full-name . "freexon")
		   (mu4e-sent-folder . "/gmail/[Gmail]/Sent Mail")
		   (mu4e-drafts-folder . "/gmail/Drafts")
		   (mu4e-trash-folder . "/gmail/Trash")))

	 ,(make-mu4e-context
	   :name "dakodeon"
	   :match-func (lambda (msg)
			 (when msg
			   (mu4e-message-contact-field-matches msg
							       :to "dakodeon@hotmail.com.com")))
	   :vars '((smtpmail-smtp-user . "dakodeon@hotmail.com")
		   (smtpmail-default-smtp-server . "smtp.office365.com")
		   (smtpmail-smtp-server . "smtp.office365.com")
		   (user-mail-address . "dakodeon@hotmail.com")
		   (user-full-name . "loukas b")
		   (mu4e-sent-folder . "/dakodeon/Sent")
		   (mu4e-drafts-folder . "/dakodeon/Drafts")
		   (mu4e-trash-folder . "/dakodeon/Trash")))))

(setq mu4e-context-policy 'pick-first)

(require 'org-mu4e)
(setq org-mu4e-convert-to-html t)
(define-key mu4e-compose-mode-map (kbd "M-c") 'org-mu4e-compose-org-mode)

(defun mu4e-open-in-headers (account)
  "Open mu4e in account's Inbox"
  (interactive)
  (mu4e~start)
  (if (get-buffer "*mu4e-headers*" )
      (switch-to-buffer "*mu4e-headers*"))
  (mu4e-headers-search (concat "maildir:/" account "/Inbox")))

(add-hook 'mu4e-index-updated-hook
	  (defun mu4e-signal-i3blocks ()
	    (shell-command "pkill -RTMIN+2 i3blocks")))

(add-hook 'mu4e-view-mode-hook 'mu4e-signal-i3blocks)

(mu4e~start)

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(use-package evil
  :ensure t
  :init
  (setq evil-move-cursor-back nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-fine-undo t)
  (setq evil-normal-state-cursor 'box)
  (setq evil-emacs-state-cursor 'bar)
  (setq evil-replace-state-cursor 'hbar)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :config 
  (evil-set-initial-state 'Info-mode 'emacs)
  (evil-set-initial-state 'org-capture-mode 'insert)
  (evil-set-initial-state 'mu4e-compose-mode 'insert)
  (evil-set-initial-state 'dired-mode 'emacs)
  (evil-define-state emacs
    "Emacs used as insert state in evil."
    :tag " <EE> "
    :message "-- EMACS INSERT --"
    :input-method t)
  (defadvice evil-insert-state (around emacs-state-instead-of-insert-state activate) (evil-emacs-state))
  (evil-mode 1)
  :bind
  (:map evil-normal-state-map
	("j" . 'evil-next-visual-line)
	("k" . 'evil-previous-visual-line)
	("^" . 'evil-beginning-of-visual-line)
	("$" . 'evil-end-of-visual-line)
	("g ^" . 'evil-beginning-of-line)
	("g $" . 'evil-end-of-line)
	([down] . 'evil-next-visual-line)
	([up] . 'evil-previous-visual-line)
	:map evil-emacs-state-map
	([escape] . 'evil-normal-state)))

(defun goto-file-or-dir (f)
  "Find the given file. If file is a directory, do helm-find-file there"
  (if (file-directory-p f)
      (helm-find-files-1 f)
    (if (file-exists-p f)
	(find-file f))))

;; create a prefix
(define-prefix-command 'z-map)
(global-set-key (kbd "C-x g") 'z-map)

(define-key z-map (kbd "E") (lambda () (interactive) (goto-file-or-dir "~/.emacs.d/init.el")))
(define-key z-map (kbd "e") (lambda () (interactive) (goto-file-or-dir "~/.emacs.d/my-config.org")))
(define-key z-map (kbd "i") (lambda () (interactive) (goto-file-or-dir "~/.config/i3/i3.conf")))
(define-key z-map (kbd "r") (lambda () (interactive) (goto-file-or-dir "~/.config/ranger/rc.conf")))
(define-key z-map (kbd "x") (lambda () (interactive) (goto-file-or-dir "~/.Xresources")))
(define-key z-map (kbd "z") (lambda () (interactive) (goto-file-or-dir "~/.zshrc")))
(define-key z-map (kbd "h") (lambda () (interactive) (goto-file-or-dir "~/")))
(define-key z-map (kbd "P") (lambda () (interactive) (goto-file-or-dir "~/Pictures/")))
(define-key z-map (kbd "p") (lambda () (interactive) (goto-file-or-dir "~/.personal/")))
(define-key z-map (kbd "C") (lambda () (interactive) (goto-file-or-dir "~/.config/")))
(define-key z-map (kbd "D") (lambda () (interactive) (goto-file-or-dir "~/Downloads/")))
(define-key z-map (kbd "d") (lambda () (interactive) (goto-file-or-dir "~/Documents/")))
(define-key z-map (kbd "c") (lambda () (interactive) (goto-file-or-dir "~/dotfiles/")))
(define-key z-map (kbd "S") (lambda () (interactive) (goto-file-or-dir "~/.config/scripts/")))
